src/Catalogs/AdditionalReportsAndDataProcessors.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>AdditionalReportsAndDataProcessors</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SafeMode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportAndDataProcessorTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Information</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForObjectForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForListForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Publication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportsAndDataProcessorsPublicationVariants</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessorStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Commands</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>StartVariant</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AdditionalDataProcessorsUsageVariants</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ShowAlert</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Modifier</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ScheduledJobGUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Assignments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FullMetadataObjectName</Name>
							<Comment>Metadata object full name</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Sections</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SectionName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/AdditionalReportsAndDataProcessors/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// EXPORT FUNCTIONS

Procedure RefreshInfoOnSchedule(AdditionalDataProcessor, Command, Schedule, Use, Cancellation) Export
	
	// get scheduled job by id, if object is not found, create new one
	ScheduledJobObject = GetScheduledJob(Command.ScheduledJobGUID);
	
	// update SJ properties
	SetScheduledJobParameters(ScheduledJobObject, Schedule, Use, AdditionalDataProcessor.Ref, Command);
	
	// write modified job
	WriteScheduledJob(Cancellation, ScheduledJobObject);
	
	//put scheduled job GUID into the object attribute
	Command.ScheduledJobGUID = ScheduledJobObject.UUID;
	
EndProcedure

Procedure DeleteScheduledJob(ScheduledJobGUID) Export
	
	ScheduledJobObject = FindScheduledJob(ScheduledJobGUID);
	
	If ScheduledJobObject <> Undefined Then
		SetPrivilegedMode(True);
		ScheduledJobObject.Delete();
	EndIf;
	
EndProcedure

Function FindScheduledJob(UUIDTasks) Export
	
	SetPrivilegedMode(True);
	
	Try
		CurrentScheduledJob = ScheduledJobs.FindByUUID(UUIDTasks);
	Except
		CurrentScheduledJob = Undefined;
	EndTry;
	
	Return CurrentScheduledJob;
	
EndFunction

////////////////////////////////////////////////////////////////////////////////
// Block of the service functions

Procedure SetScheduledJobParameters(ScheduledJobObject, Schedule, Use, Ref, Command)
	
	SJParameters = New Array;
	SJParameters.Add(Command.Id);
	SJParameters.Add(Ref);
	
	ScheduledJobDescription = 
		StringFunctionsClientServer.SubstitureParametersInString(
				NStr("en = 'Launch data processors: %1'"),
				TrimAll(Command.Presentation) );
	
	ScheduledJobObject.Description  = Left(ScheduledJobDescription, 120);
	ScheduledJobObject.Use 			= Use;
	ScheduledJobObject.Parameters   = SJParameters;
	
	ScheduledJobObject.Schedule		= Schedule;
	
EndProcedure

// Writes scheduled job
//
// Parameters:
//  Cancellation		  - Boolean - cancel flag. If there were any errors during the procedure execution,
//                          then flag is assigned to True
//  ScheduledJobObject 	  - scheduled job object, that has to be written
//
Procedure WriteScheduledJob(Cancel, ScheduledJobObject)
	
	SetPrivilegedMode(True);
	
	Try
		
		// writing  the job
		ScheduledJobObject.Write();
		
	Except
		NString = NStr("en = 'An error occurred while saving the scheduled job. 
                        |Detailed error description: %1'");
		
		MessageString = StringFunctionsClientServer.SubstitureParametersInString(NString,
								BriefErrorDescription(ErrorInfo()));
		
		CommonUseClientServer.MessageToUser(MessageString, , , , Cancel);
	EndTry;
	
EndProcedure

Function GetScheduledJob(ScheduledJobGUID)
	
	SetPrivilegedMode(True);
	
	ScheduledJobObject = FindScheduledJob(ScheduledJobGUID);
	
	// create scheduled job if required
	If ScheduledJobObject = Undefined Then
		
		ScheduledJobObject = ScheduledJobs.CreateScheduledJob("RunAdditionalDataProcessors");
		
	EndIf;
	
	Return ScheduledJobObject;
	
EndFunction
